import React from 'react';

const Answers = () => {
    return (
        <div>
            <h5>রিয়েক্ট কিভাবে কাজ করে?</h5>
            <p>রিয়েক্ট সর্বদাই একমুখী ডেটা প্রবাহ করে থাকে। তার মানে, যখন একটি রিয়েক্ট অ্যাপ ডিজাইন করা হয়, তখন প্যারেন্ট ও চাইল্ড কম্পোনেন্টের মধ্যে কানেকশন তৈরী করতে হয়। জেএসএক্স (JSX) এর অপশন গুলো সরাসরি DOM কে ম্যনিপুলেট করে। আমরা সাধারণত ওয়েবসাইটে এইচটিএমএল, সিএসএস সহ জাভাস্ক্রিপ্ট ইউজ করি। এখন ব্রাউজার বিহ্যাইন্ড দ্যা সীনে একটা ডম ট্রি তৈরী করে যাতে ইউজার সেই ডমের সাথে ইন্টার‍্যাক্ট করতে পারে। ব্রাউজারের এই প্রসেসটাকে ক্রিটিক্যাল রেন্ডার পাথ [] বলে।এভাবে একেকটা ধাপ পেরিয়ে একটা ডম(DOM) তৈরী করা হয়। তারপরে আমাদের সামনে একটা ওয়েবপেজ প্রদর্শিত হয়। রিঅ্যাক্ট একটা সেইম টু সেইম এই ব্রাউজারের ডমের মতো করে আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে এবং এফিসিয়েন্টলি।</p>
            <h5>props এবং ‍state এর মধ্যে পার্থক্য কী?</h5>
            <p> props হল ইমিউটেবল। কিন্তু ‍state হলো মিউটেবল।</p>
            <p> props ডাটা অন্য কম্পোনেন্টে পাঠাতে পারে। কিন্তু ‍state হলো পারে না</p>
            <p> props এর ডাটা চেন্জ করা যায় না। কিন্তু ‍state এ করা যায়।</p>
            <p> props চাইল্ড কম্পোনেন্ট দ্বারা এক্সেস করা যায় । কিন্তু state এ করা যায় না।</p>
            <p> props দুইটা কম্পোনেন্টের মাঝে কমিউনিকেশনের জন্য ব্যবহৃত হয়।  state নিজ কম্পোনেন্টের মধ্যে ডায়নামিক পরিবর্তনগুলি রেন্ডার করে।</p>
            <p> props একটা কম্পোনেন্টকে পুনরায় ব্যবহার যোগ্য করতে পারে।  state একটা কম্পোনেন্টকে পুনরায় ব্যবহার যোগ্য করতে পারেনা।</p>
        </div>
    );
};

export default Answers;